app/Controllers/User.php

SELECT *
FROM `m_user`
---
    public function show_user(){
     // $data = $this->db->get('m_user')->result();
     // echo json_encode($data);
     $data_user = new M_user();
     $data = $data_user->findAll();

SELECT *
FROM `m_user`
WHERE `id` = '14'
SELECT COUNT(*) AS `numrows`
FROM `m_user`
---
     public function get_user(){
      $id=$this->request->getGet('id');
      // $hsl = $this->db->query("select * from m_user where id='".$id."'");
      $data_user = new M_user();
      $data_user->where(["id" => $id]);
      $hsl = $data_user->get();
      if($data_user->countAllResults()>0){