app/Models/M_hasil.php

    public function getPm()
    {
    	$db = \Config\Database::connect();
    	$query = $db->table('m_pm_rank')->get();
---
SELECT *
FROM `m_pm_rank`