app/Models/M_hasil.php

SELECT *
FROM `m_pm_rank`
WHERE `prodi` = 'Sistem Informasi'
---
    public function getPm()
    {
        $prodi = session()->get('prodi');
    	$db = \Config\Database::connect();
    	$query = $db->table('m_pm_rank')->where('prodi',$prodi)->get();