app/Models/M_pm.php

    public function search_mahasiswa($title){
        $db = \Config\Database::connect();
        $builder = $db->table('m_user');

        $builder->select('*');
        $builder->like('nama', $title, 'both');
        $builder->orderBy('nama', 'ASC');
        $builder->where('role', 'mahasiswa');
        $builder->limit(10);
        $r = $builder->get();
---
SELECT *
FROM `m_user`
WHERE `nama` LIKE '%k%' ESCAPE '!'
AND `role` = 'mahasiswa'
ORDER BY `nama` ASC
 LIMIT 10

    public function getNilai_akhir(){
        $db = \Config\Database::connect();
        $get = $db->table('m_pm_cf_sf_temporary')->get();
---
SELECT *
FROM `m_pm_cf_sf_temporary`

    function insertRank($data)
    {
      $db = \Config\Database::connect();
      $temp = $db->table('m_pm_rank');
      $temp->insert($data);
---
INSERT INTO `m_pm_rank` (`prodi`, `id_user`, `nama`, `n_administrasi`, `n_kompetensi`, `n_mengajar`, `n_wawancara`, `n_akhir`) VALUES ('Fisika', '18', 'Kucing', '2.00', '1.66', '2.39', '0.38', '1.89')