app/Models/M_pm.php

    public function getNilai_akhir(){
        $id = session()->get('id');
        $db = \Config\Database::connect();
        $get = $db->table('m_pm_cf_sf_temporary')->where('id_user',$id)->get();
---
SELECT *
FROM `m_pm_cf_sf_temporary`
WHERE `id_user` = '18'