app/Models/M_user.php

    function getBerkas(){
    	$db = \Config\Database::connect();
        $id = session()->get('id');
    	$query = $db->table('m_berkas')->getWhere(['id_user' => $id]);
---
SELECT *
FROM `m_berkas`
WHERE `id_user` = '14'

    public function search_matkul($title){
        $db = \Config\Database::connect();
        $builder = $db->table('m_prodi');

        $builder->select('*');
        $builder->like('mata_kuliah', $title, 'both');
        $builder->orderBy('mata_kuliah', 'ASC');
        // $builder->where('role', 'mahasiswa');
        $builder->limit(10);
        $r = $builder->get();
---
SELECT *
FROM `m_prodi`
WHERE `mata_kuliah` LIKE '%Pemrograman we%' ESCAPE '!'
ORDER BY `mata_kuliah` ASC
 LIMIT 10